Console.WriteLine("Введите Число");
  int number1 = Convert.ToInt32(Console.ReadLine());
  int number2 = Convert.ToInt32(Console.ReadLine());
            if (number1 > number2)
                Console.WriteLine(number1);
            else 
                Console.WriteLine(number2);
Console.WriteLine("Максимальное число ");
 // Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.


Console.WriteLine("Введите Число");
   int number1 = Convert.ToInt32(Console.ReadLine());
   int number2 = Convert.ToInt32(Console.ReadLine());
   int number3 = Convert.ToInt32(Console.ReadLine());
         if (number1 > number2 && number1 > number3)
                    Console.WriteLine("Максимальное число " + number1); 
                else if (number2 > number3)
                    Console.WriteLine("Максимальное число " + number2); 
                else
                    Console.WriteLine("Максимальное число " + number3);
//Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.



Console.WriteLine("Введите Число");
   int number = Convert.ToInt32(Console.ReadLine());
      if (number % 2 == 0) 
      Console.WriteLine("Четное");
                else Console.WriteLine("Нечетное");
// Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).





                

 
